core-concepts/02_projects_namespaces/README.org
* Projects and namespaces

  Take a look at you current namespaces/project

  #+begin_src
oc status
  #+end_src

  Which project are you currently using?

  Store the current project name in an environment variable:

  #+begin_src
export PROJECT=$(oc project -q)
  #+end_src

  Are there any annotations on your project?

  #+begin_src sh
oc describe project $PROJECT
  #+end_src

  What is the difference to a namespace?

  #+begin_src
oc describe ns $PROJECT
  #+end_src
